GopalSaraf/Practicals/PSDL/include/proc/pic16f18056.h
extern volatile PIE0bits_t PIE0bits __at(0x096);
// bitfield macros
#define _PIE0_INTE_POSN                                     0x0
#define _PIE0_INTE_POSITION                                 0x0
#define _PIE0_INTE_SIZE                                     0x1
#define _PIE0_INTE_LENGTH                                   0x1
#define _PIE0_INTE_MASK                                     0x1
#define _PIE0_IOCIE_POSN                                    0x4
#define _PIE0_IOCIE_POSITION                                0x4
#define _PIE0_IOCIE_SIZE                                    0x1
#define _PIE0_IOCIE_LENGTH                                  0x1
#define _PIE0_IOCIE_MASK                                    0x10
#define _PIE0_TMR0IE_POSN                                   0x5
#define _PIE0_TMR0IE_POSITION                               0x5
#define _PIE0_TMR0IE_SIZE                                   0x1
#define _PIE0_TMR0IE_LENGTH                                 0x1
#define _PIE0_TMR0IE_MASK                                   0x20

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0x097);
#ifndef _LIB_BUILD
asm("PIE1 equ 097h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMIE                  :1;
        unsigned                        :1;
        unsigned ACTIE                  :1;
        unsigned TMR1IE                 :1;
        unsigned TMR1GIE                :1;
        unsigned TMR3IE                 :1;
        unsigned TMR3GIE                :1;
        unsigned TMR2IE                 :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0x097);
// bitfield macros
#define _PIE1_NVMIE_POSN                                    0x0
#define _PIE1_NVMIE_POSITION                                0x0
#define _PIE1_NVMIE_SIZE                                    0x1
#define _PIE1_NVMIE_LENGTH                                  0x1
#define _PIE1_NVMIE_MASK                                    0x1
#define _PIE1_ACTIE_POSN                                    0x2
#define _PIE1_ACTIE_POSITION                                0x2
#define _PIE1_ACTIE_SIZE                                    0x1
#define _PIE1_ACTIE_LENGTH                                  0x1
#define _PIE1_ACTIE_MASK                                    0x4
#define _PIE1_TMR1IE_POSN                                   0x3
#define _PIE1_TMR1IE_POSITION                               0x3
#define _PIE1_TMR1IE_SIZE                                   0x1
#define _PIE1_TMR1IE_LENGTH                                 0x1
#define _PIE1_TMR1IE_MASK                                   0x8
#define _PIE1_TMR1GIE_POSN                                  0x4
#define _PIE1_TMR1GIE_POSITION                              0x4
#define _PIE1_TMR1GIE_SIZE                                  0x1
#define _PIE1_TMR1GIE_LENGTH                                0x1
#define _PIE1_TMR1GIE_MASK                                  0x10
#define _PIE1_TMR3IE_POSN                                   0x5
#define _PIE1_TMR3IE_POSITION                               0x5
#define _PIE1_TMR3IE_SIZE                                   0x1
#define _PIE1_TMR3IE_LENGTH                                 0x1
#define _PIE1_TMR3IE_MASK                                   0x20
#define _PIE1_TMR3GIE_POSN                                  0x6
#define _PIE1_TMR3GIE_POSITION                              0x6
#define _PIE1_TMR3GIE_SIZE                                  0x1
#define _PIE1_TMR3GIE_LENGTH                                0x1
#define _PIE1_TMR3GIE_MASK                                  0x40
#define _PIE1_TMR2IE_POSN                                   0x7
#define _PIE1_TMR2IE_POSITION                               0x7
#define _PIE1_TMR2IE_SIZE                                   0x1
#define _PIE1_TMR2IE_LENGTH                                 0x1
#define _PIE1_TMR2IE_MASK                                   0x80

// Register: PIE2
#define PIE2 PIE2
extern volatile unsigned char           PIE2                __at(0x098);
#ifndef _LIB_BUILD
asm("PIE2 equ 098h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4IE                 :1;
        unsigned TMR6IE                 :1;
        unsigned CCP1IE                 :1;
        unsigned CCP2IE                 :1;
        unsigned NCO1IE                 :1;
        unsigned CWG1IE                 :1;
        unsigned CLC1IE                 :1;
        unsigned CLC2IE                 :1;
    };
} PIE2bits_t;
extern volatile PIE2bits_t PIE2bits __at(0x098);
// bitfield macros
#define _PIE2_TMR4IE_POSN                                   0x0
#define _PIE2_TMR4IE_POSITION                               0x0
#define _PIE2_TMR4IE_SIZE                                   0x1
#define _PIE2_TMR4IE_LENGTH                                 0x1
#define _PIE2_TMR4IE_MASK                                   0x1
#define _PIE2_TMR6IE_POSN                                   0x1
#define _PIE2_TMR6IE_POSITION                               0x1
#define _PIE2_TMR6IE_SIZE                                   0x1
#define _PIE2_TMR6IE_LENGTH                                 0x1
#define _PIE2_TMR6IE_MASK                                   0x2
#define _PIE2_CCP1IE_POSN                                   0x2
#define _PIE2_CCP1IE_POSITION                               0x2
#define _PIE2_CCP1IE_SIZE                                   0x1
#define _PIE2_CCP1IE_LENGTH                                 0x1
#define _PIE2_CCP1IE_MASK                                   0x4
#define _PIE2_CCP2IE_POSN                                   0x3
#define _PIE2_CCP2IE_POSITION                               0x3
#define _PIE2_CCP2IE_SIZE                                   0x1
#define _PIE2_CCP2IE_LENGTH                                 0x1
#define _PIE2_CCP2IE_MASK                                   0x8
#define _PIE2_NCO1IE_POSN                                   0x4
#define _PIE2_NCO1IE_POSITION                               0x4
#define _PIE2_NCO1IE_SIZE                                   0x1
#define _PIE2_NCO1IE_LENGTH                                 0x1
#define _PIE2_NCO1IE_MASK                                   0x10
#define _PIE2_CWG1IE_POSN                                   0x5
#define _PIE2_CWG1IE_POSITION                               0x5
#define _PIE2_CWG1IE_SIZE                                   0x1
#define _PIE2_CWG1IE_LENGTH                                 0x1
#define _PIE2_CWG1IE_MASK                                   0x20
#define _PIE2_CLC1IE_POSN                                   0x6
#define _PIE2_CLC1IE_POSITION                               0x6
#define _PIE2_CLC1IE_SIZE                                   0x1
#define _PIE2_CLC1IE_LENGTH                                 0x1
#define _PIE2_CLC1IE_MASK                                   0x40
#define _PIE2_CLC2IE_POSN                                   0x7
#define _PIE2_CLC2IE_POSITION                               0x7
#define _PIE2_CLC2IE_SIZE                                   0x1
#define _PIE2_CLC2IE_LENGTH                                 0x1
#define _PIE2_CLC2IE_MASK                                   0x80

// Register: PIE3
#define PIE3 PIE3
extern volatile unsigned char           PIE3                __at(0x099);
#ifndef _LIB_BUILD
asm("PIE3 equ 099h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLC3IE                 :1;
        unsigned CLC4IE                 :1;
        unsigned TX1IE                  :1;
        unsigned RC1IE                  :1;
        unsigned TX2IE                  :1;
        unsigned RC2IE                  :1;
        unsigned SSP1IE                 :1;
        unsigned BCL1IE                 :1;
    };
} PIE3bits_t;
extern volatile PIE3bits_t PIE3bits __at(0x099);
// bitfield macros
#define _PIE3_CLC3IE_POSN                                   0x0
#define _PIE3_CLC3IE_POSITION                               0x0
#define _PIE3_CLC3IE_SIZE                                   0x1
#define _PIE3_CLC3IE_LENGTH                                 0x1
#define _PIE3_CLC3IE_MASK                                   0x1
#define _PIE3_CLC4IE_POSN                                   0x1
#define _PIE3_CLC4IE_POSITION                               0x1
#define _PIE3_CLC4IE_SIZE                                   0x1
#define _PIE3_CLC4IE_LENGTH                                 0x1
#define _PIE3_CLC4IE_MASK                                   0x2
#define _PIE3_TX1IE_POSN                                    0x2
#define _PIE3_TX1IE_POSITION                                0x2
#define _PIE3_TX1IE_SIZE                                    0x1
#define _PIE3_TX1IE_LENGTH                                  0x1
#define _PIE3_TX1IE_MASK                                    0x4
#define _PIE3_RC1IE_POSN                                    0x3
#define _PIE3_RC1IE_POSITION                                0x3
#define _PIE3_RC1IE_SIZE                                    0x1
#define _PIE3_RC1IE_LENGTH                                  0x1
#define _PIE3_RC1IE_MASK                                    0x8
#define _PIE3_TX2IE_POSN                                    0x4
#define _PIE3_TX2IE_POSITION                                0x4
#define _PIE3_TX2IE_SIZE                                    0x1
#define _PIE3_TX2IE_LENGTH                                  0x1
#define _PIE3_TX2IE_MASK                                    0x10
#define _PIE3_RC2IE_POSN                                    0x5
#define _PIE3_RC2IE_POSITION                                0x5
#define _PIE3_RC2IE_SIZE                                    0x1
#define _PIE3_RC2IE_LENGTH                                  0x1
#define _PIE3_RC2IE_MASK                                    0x20
#define _PIE3_SSP1IE_POSN                                   0x6
#define _PIE3_SSP1IE_POSITION                               0x6
#define _PIE3_SSP1IE_SIZE                                   0x1
#define _PIE3_SSP1IE_LENGTH                                 0x1
#define _PIE3_SSP1IE_MASK                                   0x40
#define _PIE3_BCL1IE_POSN                                   0x7
#define _PIE3_BCL1IE_POSITION                               0x7
#define _PIE3_BCL1IE_SIZE                                   0x1
#define _PIE3_BCL1IE_LENGTH                                 0x1
#define _PIE3_BCL1IE_MASK                                   0x80

