GopalSaraf/Practicals/PSDL/include/proc/pic16f18056.h
// Register: PWM5DC
#define PWM5DC PWM5DC
extern volatile unsigned short          PWM5DC              __at(0x412);
#ifndef _LIB_BUILD
asm("PWM5DC equ 0412h");
#endif

// Register: PWM5DCL
#define PWM5DCL PWM5DCL
extern volatile unsigned char           PWM5DCL             __at(0x412);
#ifndef _LIB_BUILD
asm("PWM5DCL equ 0412h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DCL                    :2;
    };
} PWM5DCLbits_t;
extern volatile PWM5DCLbits_t PWM5DCLbits __at(0x412);
// bitfield macros
#define _PWM5DCL_DCL_POSN                                   0x6
#define _PWM5DCL_DCL_POSITION                               0x6
#define _PWM5DCL_DCL_SIZE                                   0x2
#define _PWM5DCL_DCL_LENGTH                                 0x2
#define _PWM5DCL_DCL_MASK                                   0xC0

// Register: PWM5DCH
#define PWM5DCH PWM5DCH
extern volatile unsigned char           PWM5DCH             __at(0x413);
#ifndef _LIB_BUILD
asm("PWM5DCH equ 0413h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCH                    :8;
    };
} PWM5DCHbits_t;
extern volatile PWM5DCHbits_t PWM5DCHbits __at(0x413);
// bitfield macros
#define _PWM5DCH_DCH_POSN                                   0x0
#define _PWM5DCH_DCH_POSITION                               0x0
#define _PWM5DCH_DCH_SIZE                                   0x8
#define _PWM5DCH_DCH_LENGTH                                 0x8
#define _PWM5DCH_DCH_MASK                                   0xFF

// Register: PWM5CON
#define PWM5CON PWM5CON
extern volatile unsigned char           PWM5CON             __at(0x414);
#ifndef _LIB_BUILD
asm("PWM5CON equ 0414h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM5POL                :1;
        unsigned PWM5OUT                :1;
        unsigned                        :1;
        unsigned PWM5EN                 :1;
    };
} PWM5CONbits_t;
extern volatile PWM5CONbits_t PWM5CONbits __at(0x414);
// bitfield macros
#define _PWM5CON_POL_POSN                                   0x4
#define _PWM5CON_POL_POSITION                               0x4
#define _PWM5CON_POL_SIZE                                   0x1
#define _PWM5CON_POL_LENGTH                                 0x1
#define _PWM5CON_POL_MASK                                   0x10
#define _PWM5CON_OUT_POSN                                   0x5
#define _PWM5CON_OUT_POSITION                               0x5
#define _PWM5CON_OUT_SIZE                                   0x1
#define _PWM5CON_OUT_LENGTH                                 0x1
#define _PWM5CON_OUT_MASK                                   0x20
#define _PWM5CON_EN_POSN                                    0x7
#define _PWM5CON_EN_POSITION                                0x7
#define _PWM5CON_EN_SIZE                                    0x1
#define _PWM5CON_EN_LENGTH                                  0x1
#define _PWM5CON_EN_MASK                                    0x80
#define _PWM5CON_PWM5POL_POSN                               0x4
#define _PWM5CON_PWM5POL_POSITION                           0x4
#define _PWM5CON_PWM5POL_SIZE                               0x1
#define _PWM5CON_PWM5POL_LENGTH                             0x1
#define _PWM5CON_PWM5POL_MASK                               0x10
#define _PWM5CON_PWM5OUT_POSN                               0x5
#define _PWM5CON_PWM5OUT_POSITION                           0x5
#define _PWM5CON_PWM5OUT_SIZE                               0x1
#define _PWM5CON_PWM5OUT_LENGTH                             0x1
#define _PWM5CON_PWM5OUT_MASK                               0x20
#define _PWM5CON_PWM5EN_POSN                                0x7
#define _PWM5CON_PWM5EN_POSITION                            0x7
#define _PWM5CON_PWM5EN_SIZE                                0x1
#define _PWM5CON_PWM5EN_LENGTH                              0x1
#define _PWM5CON_PWM5EN_MASK                                0x80

// Register: PWMTMRS0
#define PWMTMRS0 PWMTMRS0
extern volatile unsigned char           PWMTMRS0            __at(0x41F);
#ifndef _LIB_BUILD
asm("PWMTMRS0 equ 041Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3TSEL                 :2;
        unsigned P4TSEL                 :2;
        unsigned P5TSEL                 :2;
    };
} PWMTMRS0bits_t;
extern volatile PWMTMRS0bits_t PWMTMRS0bits __at(0x41F);
// bitfield macros
#define _PWMTMRS0_P3TSEL_POSN                               0x0
#define _PWMTMRS0_P3TSEL_POSITION                           0x0
#define _PWMTMRS0_P3TSEL_SIZE                               0x2
#define _PWMTMRS0_P3TSEL_LENGTH                             0x2
#define _PWMTMRS0_P3TSEL_MASK                               0x3
#define _PWMTMRS0_P4TSEL_POSN                               0x2
#define _PWMTMRS0_P4TSEL_POSITION                           0x2
#define _PWMTMRS0_P4TSEL_SIZE                               0x2
#define _PWMTMRS0_P4TSEL_LENGTH                             0x2
#define _PWMTMRS0_P4TSEL_MASK                               0xC
#define _PWMTMRS0_P5TSEL_POSN                               0x4
#define _PWMTMRS0_P5TSEL_POSITION                           0x4
#define _PWMTMRS0_P5TSEL_SIZE                               0x2
#define _PWMTMRS0_P5TSEL_LENGTH                             0x2
#define _PWMTMRS0_P5TSEL_MASK                               0x30

// Register: NCO1ACC
#define NCO1ACC NCO1ACC
#ifndef __CCI__
extern volatile __uint24                NCO1ACC             __at(0x48C);
#endif
#ifndef _LIB_BUILD
asm("NCO1ACC equ 048Ch");
#endif

// Register: NCO1ACCL
#define NCO1ACCL NCO1ACCL
extern volatile unsigned char           NCO1ACCL            __at(0x48C);
#ifndef _LIB_BUILD
asm("NCO1ACCL equ 048Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :8;
    };
    struct {
        unsigned NCO1ACC0               :1;
        unsigned NCO1ACC1               :1;
        unsigned NCO1ACC2               :1;
        unsigned NCO1ACC3               :1;
        unsigned NCO1ACC4               :1;
        unsigned NCO1ACC5               :1;
        unsigned NCO1ACC6               :1;
        unsigned NCO1ACC7               :1;
    };
    struct {
        unsigned ACC0                   :1;
        unsigned ACC1                   :1;
        unsigned ACC2                   :1;
        unsigned ACC3                   :1;
        unsigned ACC4                   :1;
        unsigned ACC5                   :1;
        unsigned ACC6                   :1;
        unsigned ACC7                   :1;
    };
    struct {
        unsigned NCO1ACC                :8;
    };
} NCO1ACCLbits_t;
extern volatile NCO1ACCLbits_t NCO1ACCLbits __at(0x48C);
// bitfield macros
#define _NCO1ACCL_ACC_POSN                                  0x0
#define _NCO1ACCL_ACC_POSITION                              0x0
#define _NCO1ACCL_ACC_SIZE                                  0x8
#define _NCO1ACCL_ACC_LENGTH                                0x8
#define _NCO1ACCL_ACC_MASK                                  0xFF
#define _NCO1ACCL_NCO1ACC0_POSN                             0x0
#define _NCO1ACCL_NCO1ACC0_POSITION                         0x0
#define _NCO1ACCL_NCO1ACC0_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC0_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC0_MASK                             0x1
#define _NCO1ACCL_NCO1ACC1_POSN                             0x1
#define _NCO1ACCL_NCO1ACC1_POSITION                         0x1
#define _NCO1ACCL_NCO1ACC1_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC1_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC1_MASK                             0x2
#define _NCO1ACCL_NCO1ACC2_POSN                             0x2
#define _NCO1ACCL_NCO1ACC2_POSITION                         0x2
#define _NCO1ACCL_NCO1ACC2_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC2_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC2_MASK                             0x4
#define _NCO1ACCL_NCO1ACC3_POSN                             0x3
#define _NCO1ACCL_NCO1ACC3_POSITION                         0x3
#define _NCO1ACCL_NCO1ACC3_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC3_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC3_MASK                             0x8
#define _NCO1ACCL_NCO1ACC4_POSN                             0x4
#define _NCO1ACCL_NCO1ACC4_POSITION                         0x4
#define _NCO1ACCL_NCO1ACC4_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC4_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC4_MASK                             0x10
#define _NCO1ACCL_NCO1ACC5_POSN                             0x5
#define _NCO1ACCL_NCO1ACC5_POSITION                         0x5
#define _NCO1ACCL_NCO1ACC5_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC5_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC5_MASK                             0x20
#define _NCO1ACCL_NCO1ACC6_POSN                             0x6
#define _NCO1ACCL_NCO1ACC6_POSITION                         0x6
#define _NCO1ACCL_NCO1ACC6_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC6_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC6_MASK                             0x40
#define _NCO1ACCL_NCO1ACC7_POSN                             0x7
#define _NCO1ACCL_NCO1ACC7_POSITION                         0x7
#define _NCO1ACCL_NCO1ACC7_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC7_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC7_MASK                             0x80
#define _NCO1ACCL_ACC0_POSN                                 0x0
#define _NCO1ACCL_ACC0_POSITION                             0x0
#define _NCO1ACCL_ACC0_SIZE                                 0x1
#define _NCO1ACCL_ACC0_LENGTH                               0x1
#define _NCO1ACCL_ACC0_MASK                                 0x1
#define _NCO1ACCL_ACC1_POSN                                 0x1
#define _NCO1ACCL_ACC1_POSITION                             0x1
#define _NCO1ACCL_ACC1_SIZE                                 0x1
#define _NCO1ACCL_ACC1_LENGTH                               0x1
#define _NCO1ACCL_ACC1_MASK                                 0x2
#define _NCO1ACCL_ACC2_POSN                                 0x2
#define _NCO1ACCL_ACC2_POSITION                             0x2
#define _NCO1ACCL_ACC2_SIZE                                 0x1
#define _NCO1ACCL_ACC2_LENGTH                               0x1
#define _NCO1ACCL_ACC2_MASK                                 0x4
#define _NCO1ACCL_ACC3_POSN                                 0x3
#define _NCO1ACCL_ACC3_POSITION                             0x3
#define _NCO1ACCL_ACC3_SIZE                                 0x1
#define _NCO1ACCL_ACC3_LENGTH                               0x1
#define _NCO1ACCL_ACC3_MASK                                 0x8
#define _NCO1ACCL_ACC4_POSN                                 0x4
#define _NCO1ACCL_ACC4_POSITION                             0x4
#define _NCO1ACCL_ACC4_SIZE                                 0x1
#define _NCO1ACCL_ACC4_LENGTH                               0x1
#define _NCO1ACCL_ACC4_MASK                                 0x10
#define _NCO1ACCL_ACC5_POSN                                 0x5
#define _NCO1ACCL_ACC5_POSITION                             0x5
#define _NCO1ACCL_ACC5_SIZE                                 0x1
#define _NCO1ACCL_ACC5_LENGTH                               0x1
#define _NCO1ACCL_ACC5_MASK                                 0x20
#define _NCO1ACCL_ACC6_POSN                                 0x6
#define _NCO1ACCL_ACC6_POSITION                             0x6
#define _NCO1ACCL_ACC6_SIZE                                 0x1
#define _NCO1ACCL_ACC6_LENGTH                               0x1
#define _NCO1ACCL_ACC6_MASK                                 0x40
#define _NCO1ACCL_ACC7_POSN                                 0x7
#define _NCO1ACCL_ACC7_POSITION                             0x7
#define _NCO1ACCL_ACC7_SIZE                                 0x1
#define _NCO1ACCL_ACC7_LENGTH                               0x1
#define _NCO1ACCL_ACC7_MASK                                 0x80
#define _NCO1ACCL_NCO1ACC_POSN                              0x0
#define _NCO1ACCL_NCO1ACC_POSITION                          0x0
#define _NCO1ACCL_NCO1ACC_SIZE                              0x8
#define _NCO1ACCL_NCO1ACC_LENGTH                            0x8
#define _NCO1ACCL_NCO1ACC_MASK                              0xFF

// Register: NCO1ACCH
#define NCO1ACCH NCO1ACCH
extern volatile unsigned char           NCO1ACCH            __at(0x48D);
#ifndef _LIB_BUILD
asm("NCO1ACCH equ 048Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :8;
    };
    struct {
        unsigned NCO1ACC8               :1;
        unsigned NCO1ACC9               :1;
        unsigned NCO1ACC10              :1;
        unsigned NCO1ACC11              :1;
        unsigned NCO1ACC12              :1;
        unsigned NCO1ACC13              :1;
        unsigned NCO1ACC14              :1;
        unsigned NCO1ACC15              :1;
    };
    struct {
        unsigned ACC8                   :1;
        unsigned ACC9                   :1;
        unsigned ACC10                  :1;
        unsigned ACC11                  :1;
        unsigned ACC12                  :1;
        unsigned ACC13                  :1;
        unsigned ACC14                  :1;
        unsigned ACC15                  :1;
    };
    struct {
        unsigned NCO1ACC                :8;
    };
} NCO1ACCHbits_t;
extern volatile NCO1ACCHbits_t NCO1ACCHbits __at(0x48D);
// bitfield macros
#define _NCO1ACCH_ACC_POSN                                  0x0
#define _NCO1ACCH_ACC_POSITION                              0x0
#define _NCO1ACCH_ACC_SIZE                                  0x8
#define _NCO1ACCH_ACC_LENGTH                                0x8
#define _NCO1ACCH_ACC_MASK                                  0xFF
#define _NCO1ACCH_NCO1ACC8_POSN                             0x0
#define _NCO1ACCH_NCO1ACC8_POSITION                         0x0
#define _NCO1ACCH_NCO1ACC8_SIZE                             0x1
#define _NCO1ACCH_NCO1ACC8_LENGTH                           0x1
#define _NCO1ACCH_NCO1ACC8_MASK                             0x1
#define _NCO1ACCH_NCO1ACC9_POSN                             0x1
#define _NCO1ACCH_NCO1ACC9_POSITION                         0x1
#define _NCO1ACCH_NCO1ACC9_SIZE                             0x1
#define _NCO1ACCH_NCO1ACC9_LENGTH                           0x1
#define _NCO1ACCH_NCO1ACC9_MASK                             0x2
#define _NCO1ACCH_NCO1ACC10_POSN                            0x2
#define _NCO1ACCH_NCO1ACC10_POSITION                        0x2
#define _NCO1ACCH_NCO1ACC10_SIZE                            0x1
#define _NCO1ACCH_NCO1ACC10_LENGTH                          0x1
#define _NCO1ACCH_NCO1ACC10_MASK                            0x4
#define _NCO1ACCH_NCO1ACC11_POSN                            0x3
#define _NCO1ACCH_NCO1ACC11_POSITION                        0x3
#define _NCO1ACCH_NCO1ACC11_SIZE                            0x1
#define _NCO1ACCH_NCO1ACC11_LENGTH                          0x1
#define _NCO1ACCH_NCO1ACC11_MASK                            0x8
#define _NCO1ACCH_NCO1ACC12_POSN                            0x4
#define _NCO1ACCH_NCO1ACC12_POSITION                        0x4
#define _NCO1ACCH_NCO1ACC12_SIZE                            0x1
#define _NCO1ACCH_NCO1ACC12_LENGTH                          0x1
#define _NCO1ACCH_NCO1ACC12_MASK                            0x10
#define _NCO1ACCH_NCO1ACC13_POSN                            0x5
#define _NCO1ACCH_NCO1ACC13_POSITION                        0x5
#define _NCO1ACCH_NCO1ACC13_SIZE                            0x1
#define _NCO1ACCH_NCO1ACC13_LENGTH                          0x1
#define _NCO1ACCH_NCO1ACC13_MASK                            0x20
#define _NCO1ACCH_NCO1ACC14_POSN                            0x6
#define _NCO1ACCH_NCO1ACC14_POSITION                        0x6
#define _NCO1ACCH_NCO1ACC14_SIZE                            0x1
#define _NCO1ACCH_NCO1ACC14_LENGTH                          0x1
#define _NCO1ACCH_NCO1ACC14_MASK                            0x40
#define _NCO1ACCH_NCO1ACC15_POSN                            0x7
#define _NCO1ACCH_NCO1ACC15_POSITION                        0x7
#define _NCO1ACCH_NCO1ACC15_SIZE                            0x1
#define _NCO1ACCH_NCO1ACC15_LENGTH                          0x1
#define _NCO1ACCH_NCO1ACC15_MASK                            0x80
#define _NCO1ACCH_ACC8_POSN                                 0x0
#define _NCO1ACCH_ACC8_POSITION                             0x0
#define _NCO1ACCH_ACC8_SIZE                                 0x1
#define _NCO1ACCH_ACC8_LENGTH                               0x1
#define _NCO1ACCH_ACC8_MASK                                 0x1
#define _NCO1ACCH_ACC9_POSN                                 0x1
#define _NCO1ACCH_ACC9_POSITION                             0x1
#define _NCO1ACCH_ACC9_SIZE                                 0x1
#define _NCO1ACCH_ACC9_LENGTH                               0x1
#define _NCO1ACCH_ACC9_MASK                                 0x2
#define _NCO1ACCH_ACC10_POSN                                0x2
#define _NCO1ACCH_ACC10_POSITION                            0x2
#define _NCO1ACCH_ACC10_SIZE                                0x1
#define _NCO1ACCH_ACC10_LENGTH                              0x1
#define _NCO1ACCH_ACC10_MASK                                0x4
#define _NCO1ACCH_ACC11_POSN                                0x3
#define _NCO1ACCH_ACC11_POSITION                            0x3
#define _NCO1ACCH_ACC11_SIZE                                0x1
#define _NCO1ACCH_ACC11_LENGTH                              0x1
#define _NCO1ACCH_ACC11_MASK                                0x8
#define _NCO1ACCH_ACC12_POSN                                0x4
#define _NCO1ACCH_ACC12_POSITION                            0x4
#define _NCO1ACCH_ACC12_SIZE                                0x1
#define _NCO1ACCH_ACC12_LENGTH                              0x1
#define _NCO1ACCH_ACC12_MASK                                0x10
#define _NCO1ACCH_ACC13_POSN                                0x5
#define _NCO1ACCH_ACC13_POSITION                            0x5
#define _NCO1ACCH_ACC13_SIZE                                0x1
#define _NCO1ACCH_ACC13_LENGTH                              0x1
#define _NCO1ACCH_ACC13_MASK                                0x20
#define _NCO1ACCH_ACC14_POSN                                0x6
#define _NCO1ACCH_ACC14_POSITION                            0x6
#define _NCO1ACCH_ACC14_SIZE                                0x1
#define _NCO1ACCH_ACC14_LENGTH                              0x1
#define _NCO1ACCH_ACC14_MASK                                0x40
#define _NCO1ACCH_ACC15_POSN                                0x7
#define _NCO1ACCH_ACC15_POSITION                            0x7
#define _NCO1ACCH_ACC15_SIZE                                0x1
#define _NCO1ACCH_ACC15_LENGTH                              0x1
#define _NCO1ACCH_ACC15_MASK                                0x80
#define _NCO1ACCH_NCO1ACC_POSN                              0x0
#define _NCO1ACCH_NCO1ACC_POSITION                          0x0
#define _NCO1ACCH_NCO1ACC_SIZE                              0x8
#define _NCO1ACCH_NCO1ACC_LENGTH                            0x8
#define _NCO1ACCH_NCO1ACC_MASK                              0xFF

